ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/inc/ht32f7xxxx_ckcu.h
    /* Definitions of APB0 clock control                                                                    */
    unsigned long I2C0       :1;    // Bit 0
    unsigned long I2C1       :1;    // Bit 1
    unsigned long I2C2       :1;    // Bit 2
    unsigned long            :1;    // Bit 3
    unsigned long SPI0       :1;    // Bit 4
    unsigned long SPI1       :1;    // Bit 5
    unsigned long            :1;    // Bit 6
    unsigned long            :1;    // Bit 7

    unsigned long USART0     :1;    // Bit 8
    unsigned long USART1     :1;    // Bit 9
    unsigned long UART0      :1;    // Bit 10
    unsigned long UART1      :1;    // Bit 11
    unsigned long UART2      :1;    // Bit 12
    unsigned long UART3      :1;    // Bit 13
    unsigned long AFIO       :1;    // Bit 14
    unsigned long EXTI       :1;    // Bit 15

    unsigned long            :1;    // Bit 16
    unsigned long            :1;    // Bit 17
    unsigned long            :1;    // Bit 18
    unsigned long            :1;    // Bit 19
    unsigned long            :1;    // Bit 20
    unsigned long            :1;    // Bit 21
    unsigned long            :1;    // Bit 22
    unsigned long            :1;    // Bit 23

    unsigned long SCI0       :1;    // Bit 24
    unsigned long I2S        :1;    // Bit 25
    unsigned long            :1;    // Bit 26
    unsigned long SCI1       :1;    // Bit 27
    unsigned long            :1;    // Bit 28
    unsigned long            :1;    // Bit 29
    unsigned long CAN0       :1;    // Bit 30
    unsigned long CAN1       :1;    // Bit 31

    /* Definitions of APB1 clock control                                                                    */
    unsigned long MCTM0      :1;    // Bit 0
    unsigned long            :1;    // Bit 1
    unsigned long            :1;    // Bit 2
    unsigned long            :1;    // Bit 3
    unsigned long WDT        :1;    // Bit 4
    unsigned long            :1;    // Bit 5
    unsigned long BKP        :1;    // Bit 6
    unsigned long            :1;    // Bit 7

    unsigned long GPTM0      :1;    // Bit 8
    unsigned long GPTM1      :1;    // Bit 9
    unsigned long            :1;    // Bit 10
    unsigned long            :1;    // Bit 11
    unsigned long PWM0       :1;    // Bit 12
    unsigned long PWM1       :1;    // Bit 13
    unsigned long            :1;    // Bit 14
    unsigned long RNG        :1;    // Bit 15

    unsigned long BFTM0      :1;    // Bit 16
    unsigned long BFTM1      :1;    // Bit 17
    unsigned long            :1;    // Bit 18
    unsigned long            :1;    // Bit 19
    unsigned long            :1;    // Bit 20
    unsigned long DAC0       :1;    // Bit 21
    unsigned long CMP        :1;    // Bit 22
    unsigned long            :1;    // Bit 23
    unsigned long ADC0       :1;    // Bit 24
    unsigned long            :1;    // Bit 25
    unsigned long            :1;    // Bit 26
    unsigned long            :1;    // Bit 27
    unsigned long SCTM0      :1;    // Bit 28
    unsigned long SCTM1      :1;    // Bit 29
    unsigned long SCTM2      :1;    // Bit 30
    unsigned long SCTM3      :1;    // Bit 31
  } Bit;
  u32 Reg[3];
} CKCU_PeripClockConfig_TypeDef;

#define CKCU_APBPCSR_OFFSET      (5)
#define CKCU_APBPCSR0            (0 << CKCU_APBPCSR_OFFSET)
#define CKCU_APBPCSR1            (1 << CKCU_APBPCSR_OFFSET)
#define CKCU_APBPCSR2            (4 << CKCU_APBPCSR_OFFSET)
typedef enum
{
  CKCU_PCLK_I2C0     = (CKCU_APBPCSR0 | 0),
  #if (LIBCFG_I2C1)
  CKCU_PCLK_I2C1     = (CKCU_APBPCSR0 | 2),
  #endif
  CKCU_PCLK_SPI0     = (CKCU_APBPCSR0 | 4),
  #if (LIBCFG_SPI1)
  CKCU_PCLK_SPI1     = (CKCU_APBPCSR0 | 6),
  #endif
  #if (LIBCFG_UART2)
  CKCU_PCLK_UART2    = (CKCU_APBPCSR0 | 8),
  #endif
  #if (LIBCFG_UART3)
  CKCU_PCLK_UART3    = (CKCU_APBPCSR0 | 10),
  #endif
  CKCU_PCLK_BFTM0    = (CKCU_APBPCSR0 | 12),
  #if (LIBCFG_BFTM1)
  CKCU_PCLK_BFTM1    = (CKCU_APBPCSR0 | 14),
  #endif
  #if (LIBCFG_MCTM0)
  CKCU_PCLK_MCTM0    = (CKCU_APBPCSR0 | 16),
  #endif
  #if (!LIBCFG_NO_GPTM0)
  CKCU_PCLK_GPTM0    = (CKCU_APBPCSR0 | 20),
  #endif
  #if (LIBCFG_GPTM1)
  CKCU_PCLK_GPTM1    = (CKCU_APBPCSR0 | 22),
  #endif
  #if (!LIBCFG_NO_USART0)
  CKCU_PCLK_USART0   = (CKCU_APBPCSR0 | 24),
  #endif
  #if (LIBCFG_USART1)
  CKCU_PCLK_USART1   = (CKCU_APBPCSR0 | 26),
  #endif
  CKCU_PCLK_UART0    = (CKCU_APBPCSR0 | 28),
  #if (LIBCFG_UART1)
  CKCU_PCLK_UART1    = (CKCU_APBPCSR0 | 30),
  #endif
  CKCU_PCLK_AFIO     = (CKCU_APBPCSR1 | 0),
  CKCU_PCLK_EXTI     = (CKCU_APBPCSR1 | 2),
  #if (!LIBCFG_NO_ADC)
  CKCU_PCLK_ADC0     = (CKCU_APBPCSR1 | 4),
  #endif
  #if (LIBCFG_CMP)
  CKCU_PCLK_CMP      = (CKCU_APBPCSR1 | 8),
  #endif
  CKCU_PCLK_WDTR     = (CKCU_APBPCSR1 | 12),
  CKCU_PCLK_BKPR     = (CKCU_APBPCSR1 | 14),
  #if (LIBCFG_SCI0)
  CKCU_PCLK_SCI0     = (CKCU_APBPCSR1 | 16),
  #endif
  #if (LIBCFG_SCI1)
  CKCU_PCLK_SCI1     = (CKCU_APBPCSR1 | 18),
  #endif
  #if (LIBCFG_I2S)
  CKCU_PCLK_I2S      = (CKCU_APBPCSR1 | 20),
  #endif
  #if (LIBCFG_I2C2)
  CKCU_PCLK_I2C2     = (CKCU_APBPCSR1 | 22),
  #endif
  #if (LIBCFG_SCTM0)
  CKCU_PCLK_SCTM0    = (CKCU_APBPCSR1 | 24),
  #endif
  #if (LIBCFG_SCTM1)
  CKCU_PCLK_SCTM1    = (CKCU_APBPCSR1 | 26),
  #endif
  #if (LIBCFG_SCTM2)
  CKCU_PCLK_SCTM2    = (CKCU_APBPCSR1 | 28),
  #endif
  #if (LIBCFG_SCTM3)
  CKCU_PCLK_SCTM3    = (CKCU_APBPCSR1 | 30),
  #endif
  #if (LIBCFG_DACDUAL16) || (LIBCFG_DAC0)
  CKCU_PCLK_DAC0     = (CKCU_APBPCSR2 | 2),
  #endif
  #if (LIBCFG_PWM0)
  CKCU_PCLK_PWM0     = (CKCU_APBPCSR2 | 16),
  #endif
  #if (LIBCFG_PWM1)
  CKCU_PCLK_PWM1     = (CKCU_APBPCSR2 | 18),
  #endif
  #if (LIBCFG_CAN0)
  CKCU_PCLK_CAN0     = (CKCU_APBPCSR2 | 20),
  #endif
  #if (LIBCFG_CAN1)
  CKCU_PCLK_CAN1     = (CKCU_APBPCSR2 | 22),
  #endif
  #if (LIBCFG_RNG)
  CKCU_PCLK_RNG      = (CKCU_APBPCSR2 | 30),
  #endif
} CKCU_PeripPrescaler_TypeDef;

#define CKCU_PCLK_ADC CKCU_PCLK_ADC0
/**
  * @}
  */

/* Exported constants --------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Exported_Constants CKCU exported constants
  * @{
  */

/* Definitions of clock ready flag                                                                          */
#if (LIBCFG_CKCU_USB_PLL)
#define CKCU_FLAG_USBPLLRDY     (1UL)
#endif
#if (!LIBCFG_NO_PLL)
#define CKCU_FLAG_PLLRDY        (1UL << 1)
#endif
#define CKCU_FLAG_HSERDY        (1UL << 2)
#define CKCU_FLAG_HSIRDY        (1UL << 3)
#if (LIBCFG_LSE)
#define CKCU_FLAG_LSERDY        (1UL << 4)
#endif
#define CKCU_FLAG_LSIRDY        (1UL << 5)

#define IS_CKCU_FLAG(FLAG)      (((FLAG & 0xFFFFFFC0) == 0) && (FLAG != 0))

