ht32-holtek/HT32_STD_7xxxx_FWLib/library/HT32F7xxxx_Driver/inc/ht32f7xxxx_ckcu.h
/* Definitions of clock interrupt & flag                                                                    */
#define CKCU_INT_CKS            (1UL)
#define IS_CKCU_INT_FLAG(FLAG)  (FLAG == CKCU_INT_CKS)

#define CKCU_INT_CKSIE          (1UL << 16)
#define IS_CKCU_INT(INT)        (((INT & 0xFFFEFFFF) == 0) && (INT != 0))

#if (!LIBCFG_NO_PLL)
/* Definitions of PLL frequency                                                                             */
/* 4 MHz */
#define CKCU_PLL_4M_72M         ((0UL << 28) | (18UL << 23) | (0UL << 21))
#define CKCU_PLL_4M_64M         ((0UL << 28) | ( 0UL << 23) | (0UL << 21))
#define CKCU_PLL_4M_60M         ((0UL << 28) | (15UL << 23) | (0UL << 21))
#define CKCU_PLL_4M_48M         ((0UL << 28) | (12UL << 23) | (0UL << 21))
#define CKCU_PLL_4M_24M         ((0UL << 28) | ( 6UL << 23) | (0UL << 21))
/* 8 MHz */
#define CKCU_PLL_8M_72M         ((1UL << 28) | (18UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_64M         ((1UL << 28) | (16UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_60M         ((1UL << 28) | (15UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_48M         ((0UL << 28) | ( 6UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_40M         ((0UL << 28) | ( 5UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_32M         ((0UL << 28) | ( 4UL << 23) | (0UL << 21))
#define CKCU_PLL_8M_24M         ((0UL << 28) | ( 3UL << 23) | (0UL << 21))
/* 12 MHz */
#define CKCU_PLL_12M_72M        ((0UL << 28) | ( 6UL << 23) | (0UL << 21))
#define CKCU_PLL_12M_60M        ((0UL << 28) | ( 5UL << 23) | (0UL << 21))
#define CKCU_PLL_12M_48M        ((0UL << 28) | ( 4UL << 23) | (0UL << 21))
#define CKCU_PLL_12M_24M        ((0UL << 28) | ( 2UL << 23) | (0UL << 21))
/* 16 MHz */
#define CKCU_PLL_16M_72M        ((1UL << 28) | ( 9UL << 23) | (0UL << 21))
#define CKCU_PLL_16M_64M        ((1UL << 28) | ( 8UL << 23) | (0UL << 21))
#define CKCU_PLL_16M_56M        ((1UL << 28) | ( 7UL << 23) | (0UL << 21))
#define CKCU_PLL_16M_48M        ((0UL << 28) | ( 3UL << 23) | (0UL << 21))
#define CKCU_PLL_16M_32M        ((0UL << 28) | ( 2UL << 23) | (0UL << 21))

#define IS_PLL_CFG(CFG)         (((CFG & 0xE81FFFFF) == 0x0) && (CFG != 0))
#endif

#if (LIBCFG_CKCU_USB_PLL)
/* Definitions of USBPLL frequency                                                                          */
#define CKCU_USBPLL_4M_48M      ((12UL << 7) | (0UL << 5))
#define CKCU_USBPLL_8M_48M      (( 6UL << 7) | (0UL << 5))
#define CKCU_USBPLL_12M_48M     (( 4UL << 7) | (0UL << 5))
#define CKCU_USBPLL_16M_48M     (( 3UL << 7) | (0UL << 5))

#define IS_USBPLL_CFG(CFG)      (((CFG & 0xFFFFF81F) == 0x0) && (CFG != 0))
#endif

/* Definitions of MCU debug control                                                                         */
#define CKCU_DBG_SLEEP          (1UL)
#define CKCU_DBG_DEEPSLEEP1     (1UL << 1)
#if (!LIBCFG_PWRCU_NO_PD_MODE)
#define CKCU_DBG_POWERDOWN      (1UL << 2)
#endif
#define CKCU_DBG_WDT_HALT       (1UL << 3)

#if (LIBCFG_MCTM0)
#define CKCU_DBG_MCTM0_HALT     (1UL << 4)
#endif

#if (!LIBCFG_NO_GPTM0)
#define CKCU_DBG_GPTM0_HALT     (1UL << 6)
#endif

#if (!LIBCFG_NO_USART0)
#define CKCU_DBG_USART0_HALT    (1UL << 8)
#endif

#if (LIBCFG_USART1)
#define CKCU_DBG_USART1_HALT    (1UL << 9)
#endif

#define CKCU_DBG_SPI0_HALT      (1UL << 10)

#if (LIBCFG_SPI1)
#define CKCU_DBG_SPI1_HALT      (1UL << 11)
#endif

#define CKCU_DBG_I2C0_HALT      (1UL << 12)

#if (LIBCFG_I2C1)
#define CKCU_DBG_I2C1_HALT      (1UL << 13)
#endif

#define CKCU_DBG_DEEPSLEEP2     (1UL << 14)

#if (LIBCFG_SCI0)
#define CKCU_DBG_SCI0_HALT      (1UL << 15)
#endif

#define CKCU_DBG_BFTM0_HALT     (1UL << 16)

#if (LIBCFG_BFTM1)
#define CKCU_DBG_BFTM1_HALT     (1UL << 17)
#endif

#define CKCU_DBG_UART0_HALT     (1UL << 18)

#if (LIBCFG_UART1)
#define CKCU_DBG_UART1_HALT     (1UL << 19)
#endif

#if (LIBCFG_SCI1)
#define CKCU_DBG_SCI1_HALT      (1UL << 21)
#endif

#if (LIBCFG_SCTM0)
#define CKCU_DBG_SCTM0_HALT     (1UL << 22)
#endif

#if (LIBCFG_SCTM1)
#define CKCU_DBG_SCTM1_HALT     (1UL << 23)
#endif

#if (LIBCFG_UART2)
#define CKCU_DBG_UART2_HALT     (1UL << 26)
#endif

#if (LIBCFG_UART3)
#define CKCU_DBG_UART3_HALT     (1UL << 27)
#endif

#if (LIBCFG_I2C2)
#define CKCU_DBG_I2C2_HALT      (1UL << 28)
#endif

#if (LIBCFG_QSPI)
#define CKCU_DBG_QSPI_HALT      (1UL << 29)
#endif

#if (LIBCFG_PWM0)
#define CKCU_DBG_PWM0_HALT      (1UL << 30)
#endif

#if (LIBCFG_PWM1)
#define CKCU_DBG_PWM1_HALT      (1UL << 31)
#endif

#define IS_CKCU_DBG(MODE)       (((MODE & (~0xFCEFFFDF)) == 0) && (MODE != 0))

/* Definitions of AHB clock control                                                                         */
#define CKCU_AHBEN_SLEEP_FMC    (1UL)
#define CKCU_AHBEN_SLEEP_SRAM   (1UL << 2)
#define CKCU_AHBEN_SLEEP_BM     (1UL << 5)
#define CKCU_AHBEN_SLEEP_APB0   (1UL << 6)

#define IS_CKCU_SLEEP_AHB(PERIPH)  (((PERIPH & 0xFFFFFF9A) == 0) && (PERIPH != 0))

/* Definitions of HSI Ready Counter Value                                                                   */
#if (LIBCFG_CKCU_HSIRDYCR)
#define IS_COUNTER_VALUE(VALUE) ((VALUE) < 0x20)
#endif

#if (LIBCFG_CKCU_LSI_TRIM)
#define CKCU_LSITRIM_ACCURACY_0P0         (0)
#define CKCU_LSITRIM_ACCURACY_0P5         (8000 * 0.005)
#define CKCU_LSITRIM_ACCURACY_1P0         (8000 * 0.01)
#define CKCU_LSITRIM_ACCURACY_1P5         (8000 * 0.015)
#define CKCU_LSITRIM_ACCURACY_2P0         (8000 * 0.02)
#endif

/* HSE Gain mode                                                                                            */
#define CKCU_HSE_LOW_GAIN_MODE          (0UL << 8)
#define CKCU_HSE_HIGH_GAIN_MODE         (1UL << 8)

#define IS_GAINMODE(GanMode)    ((GanMode == CKCU_HSE_LOW_GAIN_MODE) || \
                                 (GanMode == CKCU_HSE_HIGH_GAIN_MODE))

/**
  * @}
  */

/* Exported functions --------------------------------------------------------------------------------------*/
/** @defgroup CKCU_Exported_Functions CKCU exported functions
  * @{
  */
void CKCU_DeInit(void);

void CKCU_HSICmd(ControlStatus Cmd);
void CKCU_HSECmd(ControlStatus Cmd);
bool CKCU_IS_HSI_USED(CKCU_HSIST_TypeDef Target);
bool CKCU_IS_HSE_USED(CKCU_HSEST_TypeDef Target);
FlagStatus CKCU_GetClockReadyStatus(u32 CKCU_FLAG);
ErrStatus CKCU_WaitHSEReady(void);

ErrStatus CKCU_SysClockConfig(CKCU_SW_TypeDef CLKSRC);
u32 CKCU_GetSysClockSource(void);

void CKCU_PeripClockConfig(CKCU_PeripClockConfig_TypeDef Clock, ControlStatus Cmd);

